/*==============================================================================

   頂点管理[fadeBG.h]
														 Author : 七島維吹
                                                         Date   : 2023 06 23
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// 列挙体宣言
//*****************************************************************************
enum class  MODE_FADE
{
FADE_NONE=0,
FADE_IN,
FADE_OUT,
FADE_MAX
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
class Fade {
	static int m_FadeBGTexNO;//テクスチャid
	static float m_FadeAlpha;//フェードアルファ地
	static MODE_FADE m_FadeState;//フェードの状態
	struct FADEBG {
		D3DXVECTOR2		pos;	//位置ベクトル
		D3DXVECTOR2		size;	//大きさベクトル
	};
public:
	static void InitFadeBG(void);
	static void UninitFadeBG(void);
	static void UpdateFadeBG(void);
	static void DrawFadeBG(void);
	static void SetFade(MODE_FADE state);
};




