/*==============================================================================

   頂点管理[resultBG.h]
														 Author : 七島維吹
                                                         Date   : 2025 06 06
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
class ResultBG
{
	static struct RESULTBG {
		D3DXVECTOR2		pos;	//位置ベクトル
		D3DXVECTOR2		size;	//大きさベクトル
	};
	static int m_ResultBGTexNO;
	static RESULTBG m_ResultBG;
public:
	static void InitResultBG(void);
	static void UninitResultBG(void);
	static void UpdateResultBG(void);
	static void DrawResultBG(void);
};
