/*==============================================================================

   頂点管理[titleBG.h]
														 Author : 七島維吹
                                                         Date   : 2025 06 06
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************




class TitleBG
{
static struct TITLEBG {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//大きさベクトル
};
static int m_TitleBGTexNO;
static TITLEBG m_TitleBG;
public:
	static void InitTitleBG(void);
	static void UninitTitleBG(void);
	static void UpdateTitleBG(void);
	static void DrawTitleBG(void);
};